Retrieve all select

SELECT * FROM cities;

Retrieve values that are result of some operations on columns with AS clause

SELECT name, population+area AS pop_density FROM cities;

String opearations on SELECT

SELECT name || country AS name_country FROM cities;
SELECT name || ', ' || country AS name_country FROM cities;
SELECT CONCAT(name,  ', ',  country) AS name_country FROM cities;
SELECT CONCAT(UPPER(name),  ', ',  LOWER(country)) AS name_country FROM cities;
SELECT UPPER(CONCAT(name,  ', ',  country)) AS name_country FROM cities;
SELECT LENGTH(CONCAT(name,  ', ',  country)) AS city_country_len FROM cities;

SELECT WHERE operations
DB SERVER:

    1. Takes the Table (FROM)
    2. Chooses specific rows (WHERE)
    3. Selects specific columns (SELECT)

SELECT name FROM cities WHERE LENGTH(country) = 7;
SELECT name FROM cities WHERE country = 'Germany';
SELECT name FROM cities WHERE population/area > 100;
SELECT name FROM cities WHERE population/area BETWEEN 1 AND 200;
SELECT name FROM cities WHERE name IN ('Berlin');
SELECT name FROM cities WHERE LOWER(name) IN ('berlin');
SELECT name FROM cities WHERE LOWER(name) NOT IN ('berlin');
SELECT name FROM cities WHERE LOWER(name) NOT IN ('berlin') AND area > 100;
SELECT name FROM cities WHERE LOWER(name) NOT IN ('berlin') OR area > 100;
SELECT name, population/area AS density FROM cities WHERE population/area > 100;

SELECT with JOIN

SELECT url, username FROM photos 
JOIN users ON users.id = photos.id;

SELECT contents, username FROM comments 
JOIN users ON comments.user_id = users.id
WHERE username = 'Alfredo66';

<!-- In this case table_1 JOIN table_2 is the same as table_2 JOIN table_1 -->

SELECT contents, url FROM comments
JOIN photos on comments.photo_id = photos.id;

SELECT contents, url FROM photos
JOIN comments on comments.photo_id = photos.id;

<!-- Adding table_name.id (id is ambiguous) -->

SELECT comments.id FROM photos
JOIN comments on comments.photo_id = photos.id;

SELECT photos.id FROM photos
JOIN comments on comments.photo_id = photos.id;

SELECT WITH JOIN AS

SELECT p.user_id, c.contents FROM photos AS p
JOIN comments as c on p.id = c.photo_id;

SELECT com.contents AS com_contents FROM COMMENTS as com;

SELECT p.url AS photo_url, u.username AS user_name 
FROM photos AS p JOIN users as u ON p.user_id = u.id;

Different types of JOINS

LEFT JOIN

SELECT p.url AS photo_url, u.username AS user_name 
FROM photos AS p LEFT JOIN users as u ON p.user_id = u.id;

RIGHT JOIN

SELECT p.url AS photo_url, u.username AS user_name 
FROM photos AS p RIGHT JOIN users as u ON p.user_id = u.id;

FULL JOIN

SELECT p.url AS photo_url, u.username AS user_name 
FROM photos AS p FULL JOIN users as u ON p.user_id = u.id;

JOIN PLUS WHERE

SELECT url, contents FROM COMMENTS AS c
INNER JOIN photos as p ON c.photo_id = p.id
WHERE c.user_id = p.user_id;

SELECT p.url, c.contents, u.username FROM COMMENTS AS c
INNER JOIN photos as p ON c.photo_id = p.id
INNER JOIN users as u ON u.id = c.user_id
WHERE c.user_id = p.user_id;

GROUP BY/AGGREGATION

SELECT user_id FROM comments 
GROUP BY user_id;
<!-- You can only SELECT a column that you GROUP BY -->

SELECT c.id as comment_id, count(c.user_id) AS
how_many_users_wrote_the_comment
FROM comments AS c GROUP BY c.id;

SELECT c.user_id, count(c.id)
FROM comments AS c GROUP BY c.user_id;

SELECT user_id, count(*)
FROM comments GROUP BY user_id;

SELECT photot_id, COUNT(*) FROM comments
WHERE photo_id < 3
GROUP BY photo_id
HAVING COUNT(*) > 2;

SELECT user_id, count(*) FROM comments
WHERE photo_id < 3
group BY user_id
HAVING COUNT (*) > 2;

SORTING

SELECT * FROM PRODUCTS
ORDER BY weight;

SELECT * FROM PRODUCTS
ORDER BY weight ASC;

SELECT * FROM PRODUCTS
ORDER BY weight DESC;

OFFSET - skips first N rows from the result set
LIMIT - takes first N rows from the result set
OFFSET limits the range of the original dataset, LIMIT takes first N rows from the limited dataset

SELECT * FROM users LIMIT 5;
SELECT * FROM users OFFSET 40 LIMIT 2;
SELECT * FROM products ORDER BY price LIMIT 5;

SUBQUERIES

SELECT name, price FROM products
WHERE price > (
	SELECT MAX(price) FROM products
  WHERE department = 'Toys'
);

SELECT name, price, (
  SELECT MAX(price) FROM products
)
FROM products
WHERE price > 900;

SELECT name, price as p1, (
  SELECT price as p2 FROM products WHERE id =1
)
FROM products
WHERE price > 900;

SELECT AVG(p.user_orders)
FROM
(
  SELECT user_id, COUNT(*) AS user_orders 
  FROM orders 
  GROUP BY user_id
) AS p

SELECT * FROM orders AS o
WHERE o.product_id IN (
  SELECT id FROM products as p
  WHERE p.price/p.weight > 5
)

SELECT p.name FROM products AS p
WHERE p.price > (
  SELECT AVG(subp.price) FROM products AS subp
);

SELECT name FROM products AS p
WHERE p.department NOT IN (
  SELECT p1.department FROM products AS p1
  GROUP BY p1.department
  HAVING MIN(p1.price) < 100
);

SELECT p.name, p.department, p.price FROM products AS p
WHERE p.price > (
  SELECT MAX(p1.price) FROM products AS p1
  WHERE p1.department = 'Industrial'
)

Which is equal to

SELECT p.name, p.department, p.price FROM products AS p
WHERE p.price > ALL (
  SELECT price FROM products AS p1
  WHERE p1.department = 'Industrial'
)